Tekla Open API Reference for Tekla Structures 2025
View.ViewMarkTagsAttributes Class
 The ViewMarkTagsAttributes class contains attributes for view mark tags.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.View.ViewMarkTagsAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ViewMarkTagsAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class ViewMarkTagsAttributes
	Inherits GenericAttributesBase
The View.ViewMarkTagsAttributes type exposes the following members.
Constructors
Name | Description
View.ViewMarkTagsAttributes()
 Creates a new mark tags attributes instance.
View.ViewMarkTagsAttributes(View.ViewMarkTagAttributes, View.ViewMarkTagAttributes, View.ViewMarkTagAttributes, View.ViewMarkTagAttributes, View.ViewMarkTagAttributes)
 Creates a new mark tags attributes instance.
Top
Properties
Name | Description
TagA1
 The tag A1 of a mark.
TagA2
 The tag A2 of a mark.
TagA3
 The tag A3 of a mark.
TagA4
 The tag A4 of a mark.
TagA5
 The tag A5 of a mark.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace